resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-08-18 Thu 00:37 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Diamond's Resume</title>
<meta name="author" content="index (github.com/diamondbond)" />
<meta name="generator" content="Org Mode" />
<link rel="shortcut icon" href="favicon.png"/>
<link rel="stylesheet" type="text/css" href="./lib/style.css" />


</head>
<body>
<div id="content" class="content">
<h1 class="title">Diamond's Resume</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org496672a">1. Header</a>
<ul>
<li><a href="#org24cf80c">1.1. Name</a>
<ul>
<li><a href="#org5b7d0f7">1.1.1. Short description</a></li>
</ul>
</li>
<li><a href="#org06a4b3c">1.2. Birthday/Nationality</a></li>
<li><a href="#orga2107cb">1.3. Address</a></li>
</ul>
</li>
<li><a href="#org51c9d9f">2. Info</a>
<ul>
<li><a href="#orgdd7fb9a">2.1. Contact</a>
<ul>
<li><a href="#org9f1094e">2.1.1. email</a></li>
<li><a href="#org56b8025">2.1.2. phone</a></li>
</ul>
</li>
<li><a href="#org6c3cb83">2.2. Social</a>
<ul>
<li><a href="#orgcae7bd4">2.2.1. github</a></li>
<li><a href="#org9c05281">2.2.2. personal-website</a></li>
</ul>
</li>
<li><a href="#orgc13f52b">2.3. Public Keys</a>
<ul>
<li><a href="#org7092fc0">2.3.1. pgp</a></li>
<li><a href="#org67a1918">2.3.2. crypto</a></li>
</ul>
</li>
<li><a href="#orga48eb14">2.4. Languages</a></li>
</ul>
</li>
<li><a href="#org22ffd60">3. Timeline</a>
<ul>
<li><a href="#orgbc24ce3">3.1. VKonnect</a></li>
<li><a href="#orged0b696">3.2. Nomedia</a></li>
<li><a href="#org4e8bb5c">3.3. HarvardX</a></li>
<li><a href="#org9013eca">3.4. JM Dental Ceramic Studio</a></li>
</ul>
</li>
<li><a href="#orgcdf9de6">4. Knowledge</a></li>
<li><a href="#skills">5. Skills</a></li>
<li><a href="#projects">6. Projects</a></li>
</ul>
</div>
</div>

<div id="outline-container-org496672a" class="outline-2 header">
<h2 id="org496672a"><span class="section-number-2">1.</span> Header</h2>
<div class="outline-text-2" id="text-1">
</div>

<div id="outline-container-org24cf80c" class="outline-3 person-name header-item">
<h3 id="org24cf80c"><span class="section-number-3">1.1.</span> Name</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Diamond Bond
</p>
</div>

<div id="outline-container-org5b7d0f7" class="outline-4 short-description">
<h4 id="org5b7d0f7"><span class="section-number-4">1.1.1.</span> Short description</h4>
<div class="outline-text-4" id="text-1-1-1">
<p>
Software Engineer
</p>
</div>
</div>
</div>

<div id="outline-container-org06a4b3c" class="outline-3 header-item birthday-nacionality">
<h3 id="org06a4b3c"><span class="section-number-3">1.2.</span> Birthday/Nationality</h3>
<div class="outline-text-3" id="text-1-2">
<p>
December 3rd, 1999
</p>

<p>
British &amp; Sri Lankan
</p>
</div>
</div>

<div id="outline-container-orga2107cb" class="outline-3 header-item address">
<h3 id="orga2107cb"><span class="section-number-3">1.3.</span> Address</h3>
<div class="outline-text-3" id="text-1-3">
<p>
R.A. De Mel Mawatha,
</p>

<p>
Colombo 00300
</p>
</div>
</div>
</div>

<div id="outline-container-org51c9d9f" class="outline-2 info">
<h2 id="org51c9d9f" class="info-title"><span class="section-number-2">2.</span> Info</h2>
<div class="outline-text-2" id="text-2">
</div>

<div id="outline-container-orgdd7fb9a" class="outline-3 info-item contact">
<h3 id="orgdd7fb9a"><span class="section-number-3">2.1.</span> Contact</h3>
<div class="outline-text-3" id="text-2-1">
</div>

<div id="outline-container-org9f1094e" class="outline-4 email info-description link">
<h4 id="org9f1094e"><span class="section-number-4">2.1.1.</span> email</h4>
<div class="outline-text-4" id="text-2-1-1">
<p link="mailto:diamondbond1@gmail.com">
diamondbond1@gmail.com
</p>
</div>
</div>

<div id="outline-container-org56b8025" class="outline-4 phone info-description link">
<h4 id="org56b8025"><span class="section-number-4">2.1.2.</span> phone</h4>
<div class="outline-text-4" id="text-2-1-2">
<p link="tel:+1234567890">
(076) 644-9994
</p>
</div>
</div>
</div>

<div id="outline-container-org6c3cb83" class="outline-3 info-item social">
<h3 id="org6c3cb83"><span class="section-number-3">2.2.</span> Social</h3>
<div class="outline-text-3" id="text-2-2">
</div>

<div id="outline-container-orgcae7bd4" class="outline-4 github info-description link">
<h4 id="orgcae7bd4"><span class="section-number-4">2.2.1.</span> github</h4>
<div class="outline-text-4" id="text-2-2-1">
<p link="https://github.com/diamondbond">
github.com/diamondbond
</p>
</div>
</div>

<div id="outline-container-org9c05281" class="outline-4 personal-website info-description link">
<h4 id="org9c05281"><span class="section-number-4">2.2.2.</span> personal-website</h4>
<div class="outline-text-4" id="text-2-2-2">
<p link="https://diamondbond.neocities.org">
diamondbond.neocities.org
</p>
</div>
</div>
</div>

<div id="outline-container-orgc13f52b" class="outline-3 info-item public-keys">
<h3 id="orgc13f52b"><span class="section-number-3">2.3.</span> Public Keys</h3>
<div class="outline-text-3" id="text-2-3">
</div>

<div id="outline-container-org7092fc0" class="outline-4 pgp info-description link">
<h4 id="org7092fc0"><span class="section-number-4">2.3.1.</span> pgp</h4>
<div class="outline-text-4" id="text-2-3-1">
<p link="https://github.com/diamondbond.gpg">
<b>PGP</b> 0xC86D8278
</p>
</div>
</div>

<div id="outline-container-org67a1918" class="outline-4 eth info-description link">
<h4 id="org67a1918"><span class="section-number-4">2.3.2.</span> crypto</h4>
<div class="outline-text-4" id="text-2-3-2">
<p link="https://courses.edx.org/certificates/e3df6f9f02eb44d5997d2b0a1bd655a5">
<b>CS50X</b> 0xE3DF..66a5
</p>
</div>
</div>
</div>

<div id="outline-container-orga48eb14" class="outline-3 info-item languages">
<h3 id="orga48eb14"><span class="section-number-3">2.4.</span> Languages</h3>
<div class="outline-text-3" id="text-2-4">
<ul class="org-ul">
<li><b>EN-GB</b> native</li>
<li><b>LK</b> casual</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org22ffd60" class="outline-2 timeline">
<h2 id="org22ffd60"><span class="section-number-2">3.</span> Timeline</h2>
<div class="outline-text-2" id="text-3">
</div>

<div id="outline-container-orgbc24ce3" class="outline-3 timeline-item now">
<h3 id="orgbc24ce3"><span class="section-number-3">3.1.</span> VKonnect</h3>
<div class="outline-text-3" id="text-3-1">
<p date="2022 - now">
REMOTE SOFTWARE ENGINEER
</p>
</div>
</div>

<div id="outline-container-orged0b696" class="outline-3 timeline-item">
<h3 id="orged0b696"><span class="section-number-3">3.2.</span> Nomedia</h3>
<div class="outline-text-3" id="text-3-2">
<p date="2021 - 2022">
PART TIME FULL-STACK DEVELOPER
</p>
</div>
</div>

<div id="outline-container-org4e8bb5c" class="outline-3 timeline-item education">
<h3 id="org4e8bb5c"><span class="section-number-3">3.3.</span> HarvardX</h3>
<div class="outline-text-3" id="text-3-3">
<p date="2021 - 2022">
CS50X CERTIFICATION
</p>
</div>
</div>

<div id="outline-container-org9013eca" class="outline-3 timeline-item">
<h3 id="org9013eca"><span class="section-number-3">3.4.</span> JM Dental Ceramic Studio</h3>
<div class="outline-text-3" id="text-3-4">
<p date="2020 - 2021">
FULL TIME FULL-STACK DEVELOPER
</p>
</div>
</div>
</div>

<div id="outline-container-orgcdf9de6" class="outline-2 knowledge">
<h2 id="orgcdf9de6"><span class="section-number-2">4.</span> Knowledge</h2>
<div class="outline-text-2" id="text-4">
<p>
Software developer with 2+ years of professional experience, currently developing solutions with Gatsby/Expo/React/TS/JS and Firebase/Netlify.
Had a fair share of working with SCRUM for several sprint cycles.
</p>

<p>
Experience with creating productivity-driven shell utilities and automation tools.
</p>

<p>
Extensive real world experience in scaling up systems &amp; web applications.
</p>

<p>
Delivered a modern integration platform for a dental studio which is the state of the art CAD/CAM Digital Dental Laboratory situated in Limassol, Cyprus.
</p>

<p>
Passion for programming language theory, operating systems, kernel design &amp; compiler theory.
</p>
</div>
</div>

<div id="outline-container-skills" class="outline-2">
<h2 id="skills"><span class="section-number-2">5.</span> Skills</h2>
<div class="outline-text-2" id="text-skills">
<ul class="org-ul">
<li><b>Git</b></li>
<li><b>Linux</b></li>
<li><b>Python</b></li>
<li><b>C/C++</b></li>
<li><b>C#</b></li>
<li><b>.NET</b></li>
<li><b>JS/TS</b></li>
<li><b>React</b></li>
<li><b>Expo</b></li>
<li><b>Gatsby</b></li>
<li><b>Shell Scripting</b></li>
<li><b>Automation</b></li>
</ul>
</div>
</div>

<div id="outline-container-projects" class="outline-2">
<h2 id="projects"><span class="section-number-2">6.</span> Projects</h2>
<div class="outline-text-2" id="text-projects">
<ul class="org-ul">
<li><b><a href="https://play.google.com/store/apps/details?id=com.jmdcs.app">jmdcs</a> <i>expo</i> <i>app</i> <i>ts</i></b> JM Dental Ceramic Studio app</li>
<li><b><a href="https://nomedia.netlify.app">nomedia</a> <i>gatsby</i> <i>js</i> <i>ts</i></b> Clean looking website</li>
<li><b><a href="https://github.com/DiamondBond/scraper">scraper</a> <i>pyqt5</i> <i>shell</i> <i>python</i></b> LinkedIn scraper</li>
<li><b><a href="https://diamondbond.neocities.org/emacs.html">emacs</a> <i>elisp</i> <i>shell</i> <i>unix</i></b> Literate Emacs configuration</li>
<li><b><a href="https://github.com/diamondbond/kalisp">kalisp</a> <i>lisp</i> <i>plt</i> <i>λ-calc</i></b> Rudimentary Lisp implementation</li>
</ul>
</div>
</div>
</div>
</body>
</html>
